# Множества
# nam_set = (1, 2, 3, 4, 5, 6)
# print(nam_set)
# # d = set{} создание пустого множества только через функцию set
#
# nam = (1, 2, 3, 4, 5, 6, 2, 5, 6)
# num_s = set(nam)
# print(num_s)

# nam_set = (1, 2, 3, 4, 5, 6)
# for  i in nam_set:
#     print(i)

#Добавление элементов при помощи функции "add"
# nam_set = (1, 2, 3, 4, 5, 6)
# nam_set.add(123)
# print(nam_set)

# nam_set = {1, "mar", 2, 3, 4, 5, 6, "hello"}
# a = nam_set.pop()
# print(nam_set, a)

#Объединение можеств
# months_a = {4, 5, 6}
# months_b = {5, 7, 8}
# all = months_a.union(months_b)
# print(all)
# print(months_a | months_b)  # вместо union можно использовать "|"

# пересечение множеств

# months_a = {4, 5, 6}
# months_b = {5, 7, 8}
# inters = months_a.intersection(months_b)
# print(inters)

# разница между множествами

# a = {4, 5, 6}
# b = {5, 7, 8}
# print(a-b) # результат  4,6
# print(b-a) # результат 8,7

# Задача 1
# lst = {1, 2, 3, 4, 6, 5, 8}
#
# if lat_set ==


